zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/MK66FN2M0VLQ18-pinctrl.h
/*
 * NOTE: Autogenerated file by kinetis_signal2dts.py
 *       for MK66FN2M0VLQ18/signal_configuration.xml
 *
 * Copyright (c) 2022, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MK64FX512VLQ12-pinctrl.h with this part's differences applied
 * below (19 removed, 0 changed,
 * 118 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 05c4b096a0287829
 */

#ifndef _ZEPHYR_DTS_BINDING_MK66FN2M0VLQ18_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MK66FN2M0VLQ18_WRAPPER_

#include "MK64FX512VLQ12-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_DM2_PTE3
#undef ADC0_DP2_PTE2
#undef UART0_COL_b_PTA0
#undef UART0_COL_b_PTA16
#undef UART0_COL_b_PTB3
#undef UART0_COL_b_PTD5
#undef UART5_CTS_b_PTD11
#undef UART5_CTS_b_PTE10
#undef UART5_RTS_b_PTD10
#undef UART5_RTS_b_PTE11
#undef UART5_RX_PTD8
#undef UART5_RX_PTE9
#undef UART5_TX_PTD9
#undef UART5_TX_PTE8
#undef USB_CLKIN_PTA5
#undef USB_CLKIN_PTE26
#undef USB_SOF_OUT_PTC0
#undef USB_SOF_OUT_PTC7
#undef USB_SOF_OUT_PTE6

/* Signals specific to this part */
#define CAN1_RX_PTC16 KINETIS_MUX('C',16,2)
#define CAN1_RX_PTE25 KINETIS_MUX('E',25,2)
#define CAN1_TX_PTC17 KINETIS_MUX('C',17,2)
#define CAN1_TX_PTE24 KINETIS_MUX('E',24,2)
#define CMP3_IN1_PTA15 KINETIS_MUX('A',15,0)
#define CMP3_IN2_PTA16 KINETIS_MUX('A',16,0)
#define CMP3_IN4_PTA24 KINETIS_MUX('A',24,0)
#define CMP3_IN5_PTA25 KINETIS_MUX('A',25,0)
#define CMP3_OUT_PTB23 KINETIS_MUX('B',23,6)
#define FTM_CLKIN0_PTC12 KINETIS_MUX('C',12,4)
#define FTM_CLKIN1_PTC13 KINETIS_MUX('C',13,4)
#define I2C3_SCL_PTA2 KINETIS_MUX('A',2,4)
#define I2C3_SCL_PTE11 KINETIS_MUX('E',11,2)
#define I2C3_SDA_PTA1 KINETIS_MUX('A',1,4)
#define I2C3_SDA_PTE10 KINETIS_MUX('E',10,2)
#define LLWU_P16_PTE6 KINETIS_MUX('E',6,1)
#define LLWU_P17_PTE9 KINETIS_MUX('E',9,1)
#define LLWU_P18_PTE10 KINETIS_MUX('E',10,1)
#define LLWU_P21_PTE25 KINETIS_MUX('E',25,1)
#define LLWU_P22_PTA10 KINETIS_MUX('A',10,1)
#define LLWU_P23_PTA11 KINETIS_MUX('A',11,1)
#define LLWU_P24_PTD8 KINETIS_MUX('D',8,1)
#define LLWU_P25_PTD11 KINETIS_MUX('D',11,1)
#define LPUART0_CTS_b_PTA0 KINETIS_MUX('A',0,5)
#define LPUART0_CTS_b_PTD11 KINETIS_MUX('D',11,5)
#define LPUART0_CTS_b_PTE10 KINETIS_MUX('E',10,5)
#define LPUART0_RTS_b_PTA3 KINETIS_MUX('A',3,5)
#define LPUART0_RTS_b_PTD10 KINETIS_MUX('D',10,5)
#define LPUART0_RTS_b_PTE11 KINETIS_MUX('E',11,5)
#define LPUART0_RX_PTA1 KINETIS_MUX('A',1,5)
#define LPUART0_RX_PTD8 KINETIS_MUX('D',8,5)
#define LPUART0_RX_PTE9 KINETIS_MUX('E',9,5)
#define LPUART0_TX_PTA2 KINETIS_MUX('A',2,5)
#define LPUART0_TX_PTD9 KINETIS_MUX('D',9,5)
#define LPUART0_TX_PTE8 KINETIS_MUX('E',8,5)
#define MII0_MDC_PTA8 KINETIS_MUX('A',8,5)
#define MII0_MDIO_PTA7 KINETIS_MUX('A',7,5)
#define RMII0_MDC_PTA8 KINETIS_MUX('A',8,5)
#define RMII0_MDIO_PTA7 KINETIS_MUX('A',7,5)
#define SDRAM_A10_PTD4 KINETIS_MUX('D',4,5)
#define SDRAM_A11_PTD3 KINETIS_MUX('D',3,5)
#define SDRAM_A12_PTD2 KINETIS_MUX('D',2,5)
#define SDRAM_A13_PTC10 KINETIS_MUX('C',10,5)
#define SDRAM_A14_PTC9 KINETIS_MUX('C',9,5)
#define SDRAM_A15_PTC8 KINETIS_MUX('C',8,5)
#define SDRAM_A16_PTC7 KINETIS_MUX('C',7,5)
#define SDRAM_A17_PTC6 KINETIS_MUX('C',6,5)
#define SDRAM_A18_PTC5 KINETIS_MUX('C',5,5)
#define SDRAM_A19_PTC4 KINETIS_MUX('C',4,5)
#define SDRAM_A20_PTC2 KINETIS_MUX('C',2,5)
#define SDRAM_A21_PTC1 KINETIS_MUX('C',1,5)
#define SDRAM_A22_PTC0 KINETIS_MUX('C',0,5)
#define SDRAM_A23_PTB18 KINETIS_MUX('B',18,5)
#define SDRAM_A9_PTD5 KINETIS_MUX('D',5,5)
#define SDRAM_CAS_b_PTB0 KINETIS_MUX('B',0,5)
#define SDRAM_CKE_PTD7 KINETIS_MUX('D',7,5)
#define SDRAM_CS0_b_PTB3 KINETIS_MUX('B',3,5)
#define SDRAM_CS1_b_PTB4 KINETIS_MUX('B',4,5)
#define SDRAM_D16_PTB17 KINETIS_MUX('B',17,5)
#define SDRAM_D17_PTB16 KINETIS_MUX('B',16,5)
#define SDRAM_D18_PTB11 KINETIS_MUX('B',11,5)
#define SDRAM_D19_PTB10 KINETIS_MUX('B',10,5)
#define SDRAM_D20_PTB9 KINETIS_MUX('B',9,5)
#define SDRAM_D21_PTB8 KINETIS_MUX('B',8,5)
#define SDRAM_D22_PTB7 KINETIS_MUX('B',7,5)
#define SDRAM_D23_PTB6 KINETIS_MUX('B',6,5)
#define SDRAM_D24_PTC15 KINETIS_MUX('C',15,5)
#define SDRAM_D25_PTC14 KINETIS_MUX('C',14,5)
#define SDRAM_D26_PTC13 KINETIS_MUX('C',13,5)
#define SDRAM_D27_PTC12 KINETIS_MUX('C',12,5)
#define SDRAM_D28_PTB23 KINETIS_MUX('B',23,5)
#define SDRAM_D29_PTB22 KINETIS_MUX('B',22,5)
#define SDRAM_D30_PTB21 KINETIS_MUX('B',21,5)
#define SDRAM_D31_PTB20 KINETIS_MUX('B',20,5)
#define SDRAM_DQM0_PTC19 KINETIS_MUX('C',19,5)
#define SDRAM_DQM1_PTC18 KINETIS_MUX('C',18,5)
#define SDRAM_DQM2_PTC16 KINETIS_MUX('C',16,5)
#define SDRAM_DQM3_PTC17 KINETIS_MUX('C',17,5)
#define SDRAM_RAS_b_PTB1 KINETIS_MUX('B',1,5)
#define SDRAM_WE_PTB2 KINETIS_MUX('B',2,5)
#define TPM1_CH0_PTA12 KINETIS_MUX('A',12,7)
#define TPM1_CH0_PTA8 KINETIS_MUX('A',8,6)
#define TPM1_CH0_PTB0 KINETIS_MUX('B',0,6)
#define TPM1_CH1_PTA13 KINETIS_MUX('A',13,7)
#define TPM1_CH1_PTA9 KINETIS_MUX('A',9,6)
#define TPM1_CH1_PTB1 KINETIS_MUX('B',1,6)
#define TPM2_CH0_PTA10 KINETIS_MUX('A',10,6)
#define TPM2_CH0_PTB18 KINETIS_MUX('B',18,6)
#define TPM2_CH1_PTA11 KINETIS_MUX('A',11,6)
#define TPM2_CH1_PTB19 KINETIS_MUX('B',19,6)
#define TPM_CLKIN0_PTA18 KINETIS_MUX('A',18,7)
#define TPM_CLKIN0_PTB16 KINETIS_MUX('B',16,7)
#define TPM_CLKIN0_PTC12 KINETIS_MUX('C',12,7)
#define TPM_CLKIN1_PTA19 KINETIS_MUX('A',19,7)
#define TPM_CLKIN1_PTB17 KINETIS_MUX('B',17,7)
#define TPM_CLKIN1_PTC13 KINETIS_MUX('C',13,7)
#define TSI0_CH0_PTB0 KINETIS_MUX('B',0,0)
#define TSI0_CH10_PTB17 KINETIS_MUX('B',17,0)
#define TSI0_CH11_PTB18 KINETIS_MUX('B',18,0)
#define TSI0_CH12_PTB19 KINETIS_MUX('B',19,0)
#define TSI0_CH13_PTC0 KINETIS_MUX('C',0,0)
#define TSI0_CH14_PTC1 KINETIS_MUX('C',1,0)
#define TSI0_CH15_PTC2 KINETIS_MUX('C',2,0)
#define TSI0_CH1_PTA0 KINETIS_MUX('A',0,0)
#define TSI0_CH2_PTA1 KINETIS_MUX('A',1,0)
#define TSI0_CH3_PTA2 KINETIS_MUX('A',2,0)
#define TSI0_CH4_PTA3 KINETIS_MUX('A',3,0)
#define TSI0_CH5_PTA4 KINETIS_MUX('A',4,0)
#define TSI0_CH6_PTB1 KINETIS_MUX('B',1,0)
#define TSI0_CH7_PTB2 KINETIS_MUX('B',2,0)
#define TSI0_CH8_PTB3 KINETIS_MUX('B',3,0)
#define TSI0_CH9_PTB16 KINETIS_MUX('B',16,0)
#define USB0_CLKIN_PTA5 KINETIS_MUX('A',5,2)
#define USB0_CLKIN_PTE26 KINETIS_MUX('E',26,7)
#define USB0_SOF_OUT_PTC0 KINETIS_MUX('C',0,4)
#define USB0_SOF_OUT_PTC7 KINETIS_MUX('C',7,3)
#define USB0_SOF_OUT_PTE6 KINETIS_MUX('E',6,7)
#define USB1_ID_PTE10 KINETIS_MUX('E',10,7)

#endif /* _ZEPHYR_DTS_BINDING_MK66FN2M0VLQ18_WRAPPER_ */
